GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/rtos_task.c
/*
 * Copyright (c) 2019-2022 Thomas Roell.  All rights reserved.
 *
 * Permission is hereby granted, free of charge, to any person obtaining a copy
 * of this software and associated documentation files (the "Software"), to
 * deal with the Software without restriction, including without limitation the
 * rights to use, copy, modify, merge, publish, distribute, sublicense, and/or
 * sell copies of the Software, and to permit persons to whom the Software is
 * furnished to do so, subject to the following conditions:
 *
 *  1. Redistributions of source code must retain the above copyright notice,
 *     this list of conditions and the following disclaimers.
 *  2. Redistributions in binary form must reproduce the above copyright
 *     notice, this list of conditions and the following disclaimers in the
 *     documentation and/or other materials provided with the distribution.
 *  3. Neither the name of Thomas Roell, nor the names of its contributors
 *     may be used to endorse or promote products derived from this Software
 *     without specific prior written permission.
 *
 * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
 * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
 * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT.  IN NO EVENT SHALL THE
 * CONTRIBUTORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
 * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING
 * FROM, OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS
 * WITH THE SOFTWARE.
 */

#include "armv7m.h"
#include "stm32wb_system.h"
#include "stm32wb_lptim.h"
#include "stm32wb_gpio.h"

#include "rtos_api.h"
#include "rtos_core.h"

typedef struct _k_task_params_t {
    const char                  *name;
    k_task_routine_t            routine;
    void                        *context;
    uint32_t                    priority;
    void                        *stack_base;
    uint32_t                    stack_size;
    uint32_t                    options;
} k_task_params_t;

static uint32_t armv7m_rtos_task_state(k_task_t *task);

static void armv7m_rtos_task_resume_process(k_task_t *task);
static void armv7m_rtos_task_resume_routine(void);

static void armv7m_rtos_task_wakeup_process(k_task_t *task);
static void armv7m_rtos_task_wakeup_routine(void);

static int __svc_armv7m_rtos_task_create(k_task_t *task, const k_task_params_t *params);
static int __svc_armv7m_rtos_task_terminate(k_task_t *task);
static int __svc_armv7m_rtos_task_detach(k_task_t *task);
static int __svc_armv7m_rtos_task_join(k_task_t *task);
static int __svc_armv7m_rtos_task_enumerate(uint32_t *p_count_return, k_task_t **p_task_return, uint32_t count);
static int __svc_armv7m_rtos_task_info(k_task_t *task, k_task_info_t *p_task_info_return);
static int __svc_armv7m_rtos_task_stack(k_task_t *task, uint32_t *p_stack_base_return, uint32_t *p_stack_size_return, uint32_t *p_stack_space_return);
static int __svc_armv7m_rtos_task_unblock(k_task_t *task);
static int __svc_armv7m_rtos_task_suspend(k_task_t *task);
static int __svc_armv7m_rtos_task_resume(k_task_t *task);
static int __svc_armv7m_rtos_task_set_priority(k_task_t *task, uint32_t priority, uint32_t *p_priority_return);
static int __svc_armv7m_rtos_task_get_priority(k_task_t *task, uint32_t *p_priority_return);
static int __svc_armv7m_rtos_task_delay(uint32_t delay);
static int __svc_armv7m_rtos_task_delay_until(uint32_t clock_l, uint32_t clock_h);
static int __svc_armv7m_rtos_task_sleep(uint32_t timeout);
static int __svc_armv7m_rtos_task_wakeup(k_task_t *task);
static int __svc_armv7m_rtos_task_yield(void);

/******************************************************************************************************************************/

static uint32_t armv7m_rtos_task_state(k_task_t *task)
{
    return ((task->state & K_TASK_STATE_TERMINATED)
            ? K_STATE_TERMINATED
            : ((task->state & K_TASK_STATE_SUSPENDED)
               ? K_STATE_SUSPENDED
               : ((task->state & K_TASK_STATE_WAIT_MASK)
                  ? K_STATE_BLOCKED
                  : ((task->state & K_TASK_STATE_READY)
                     ? ((task != armv7m_rtos_control.task_self) ? K_STATE_READY : K_STATE_RUNNING)
                     : K_STATE_INACTIVE))));
}

void armv7m_rtos_join_release(k_task_t *task)
{
    armv7m_rtos_task_destroy(task->wait.join.task);

    task->state &= ~K_TASK_STATE_WAIT_MASK;

    if (!(task->state & K_TASK_STATE_SUSPENDED))
    {
        armv7m_rtos_task_ready_insert(task);
                
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
        (*armv7m_rtos_control.hook_table->task_ready)(task);
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
    }
    else
    {
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
        (*armv7m_rtos_control.hook_table->task_block)(task, (task->state & K_TASK_STATE_CAUSE_MASK));
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
    }
}

void armv7m_rtos_join_unblock(k_task_t *task)
{
    task->wait.join.task->join = NULL;
}

void armv7m_rtos_delay_unblock(k_task_t *task)
{
}

void armv7m_rtos_sleep_unblock(k_task_t *task)
{
}

static void armv7m_rtos_task_resume_process(k_task_t *task)
{
    k_task_t *task_resume;
  
    do
    {
        task_resume = task->resume;
            
        task->state &= ~K_TASK_STATE_SUSPENDED;

        if (!(task->state & K_TASK_STATE_TERMINATED))
        {
            if (!(task->state & K_TASK_STATE_WAIT_MASK))
            {
                armv7m_rtos_task_ready_insert(task);
                
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
                (*armv7m_rtos_control.hook_table->task_ready)(task);
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
            }
            else
            {
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
                (*armv7m_rtos_control.hook_table->task_block)(task, (task->state & K_TASK_STATE_CAUSE_MASK));
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
            }
        }
            
        task->resume = NULL;

        task = task_resume;
    }
    while (task != K_TASK_SENTINEL);

    armv7m_rtos_task_schedule();
}

static void armv7m_rtos_task_resume_routine(void)
{
    k_task_t *task_resume, *task_previous, *task_next;

