GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/rtos_task.c
    task_resume = (k_task_t*)__armv7m_atomic_swap((volatile uint32_t*)&armv7m_rtos_control.task_resume, (uint32_t)K_TASK_SENTINEL);

    if (task_resume != K_TASK_SENTINEL)
    {
        if (task_resume->resume != K_TASK_SENTINEL)
        {
            for (task_previous = K_TASK_SENTINEL; task_resume != K_TASK_SENTINEL; task_resume = task_next)
            {
                task_next = task_resume->resume;
                
                task_resume->resume = task_previous;
                
                task_previous = task_resume;
            }
            
            task_resume = task_previous;
        }
        
        armv7m_rtos_task_resume_process(task_resume);
    }
}

static void armv7m_rtos_task_wakeup_process(k_task_t *task)
{
    k_task_t *task_wakeup;

    do
    {
        task_wakeup = task->wakeup;

        task->state |= K_TASK_STATE_WAKEUP;
        
        if ((task->state & K_TASK_STATE_WAIT_MASK) == K_TASK_STATE_WAIT_SLEEP)
        {
            task->state &= ~K_TASK_STATE_WAKEUP;

            armv7m_rtos_task_release(task);
        }

        task->wakeup = NULL;

        task = task_wakeup;
    }
    while (task != K_TASK_SENTINEL);

    armv7m_rtos_task_timeout_schedule();

    armv7m_rtos_task_schedule();
}

static void armv7m_rtos_task_wakeup_routine(void)
{
    k_task_t *task_wakeup, *task_previous, *task_next;

    task_wakeup = (k_task_t*)__armv7m_atomic_swap((volatile uint32_t*)&armv7m_rtos_control.task_wakeup, (uint32_t)K_TASK_SENTINEL);

    if (task_wakeup != K_TASK_SENTINEL)
    {
        if (task_wakeup->wakeup != K_TASK_SENTINEL)
        {
            for (task_previous = K_TASK_SENTINEL; task_wakeup != K_TASK_SENTINEL; task_wakeup = task_next)
            {
                task_next = task_wakeup->wakeup;
                
                task_wakeup->wakeup = task_previous;
                
                task_previous = task_wakeup;
            }
            
            task_wakeup = task_previous;
        }
        
        armv7m_rtos_task_wakeup_process(task_wakeup);
    }
}

/******************************************************************************************************************************/

static int __svc_armv7m_rtos_task_create(k_task_t *task, const k_task_params_t *params)
{
    // armv7m_rtt_printf("k_task_create(task=%08x, name=\"%s\", routine=%08x, context=%0x, priority=%d, stack_base=%08x, stack_size=%d, options=%08x)\n", task, params->name, params->routine, params->context, params->priority, params->stack_base, params->stack_size, params->options);

    if (armv7m_rtos_control.work_self)
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }
    
    if (!task)
    {
        return K_ERR_INVALID_OBJECT;
    }

    if (!params->routine)
    {
        return K_ERR_INVALID_PARAMETER;
    }

    if ((params->priority < K_PRIORITY_MAX) || (params->priority > K_PRIORITY_MIN))
    {
        return K_ERR_INVALID_PARAMETER;
    }

    if ((uint32_t)params->stack_base & 7)
    {
        return K_ERR_INVALID_PARAMETER;
    }

    if ((params->stack_size & 7) || (params->stack_size < K_STACK_SIZE_MIN))
    {
        return K_ERR_INVALID_PARAMETER;
    }
    
    if (params->options & ~(K_TASK_SUSPENDED | K_TASK_JOINABLE))
    {
        return K_ERR_INVALID_PARAMETER;
    }
    
    armv7m_rtos_task_create(task, params->name, params->priority, params->stack_base, params->stack_size, params->options);

    armv7m_rtos_task_start(task, params->routine, params->context);
    
    armv7m_rtos_task_schedule();
    
    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_terminate(k_task_t *task)
{
    // armv7m_rtt_printf("k_task_terminate(task=%08x)\n", task);

    /* No need to check for K_STATE_LOCKED here. Because we do
     * not allow task_self to be terminated, there is not way
     * to switch the current task out and end up with a locked up
     * system.
     */

    if (task == armv7m_rtos_control.task_self)
    {
        return K_ERR_ILLEGAL_USE;
    }
    
    if (task == armv7m_rtos_control.task_default)
    {
        return K_ERR_ILLEGAL_USE;
    }

    if (!task || !task->link || (task->state & K_TASK_STATE_TERMINATED))
    {
        return K_ERR_INVALID_OBJECT;
    }

    task->state |= K_TASK_STATE_TERMINATED;

    if (task->state & K_TASK_STATE_SUSPENDED)
    {
        if (armv7m_atomic_cas((volatile uint32_t*)&task->resume, (uint32_t)NULL, (uint32_t)K_TASK_SENTINEL) != (uint32_t)NULL)
        {
            armv7m_rtos_task_resume_routine();
        }
    }
    
    if (task->state & K_TASK_STATE_WAIT_MASK)
    {
        if ((task->state & K_TASK_STATE_WAIT_MASK) == K_TASK_STATE_WAIT_SLEEP)
        {
            if (armv7m_atomic_cas((volatile uint32_t*)&task->wakeup, (uint32_t)NULL, (uint32_t)K_TASK_SENTINEL) != (uint32_t)NULL)
            {
                armv7m_rtos_task_wakeup_routine();
            }
        }
        else
        {
            armv7m_rtos_task_unblock(task, K_ERR_UNSATISFIED);
        }
    }

    if (task->state & K_TASK_STATE_READY)
    {
        armv7m_rtos_task_ready_remove(task);
    }

    if (task->join)
    {
        armv7m_rtos_join_release(task->join);
    }

    armv7m_rtos_mutex_destroy(task);

#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
    (*armv7m_rtos_control.hook_table->task_terminate)(task);
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
    
    if (!(task->state & K_TASK_STATE_JOINABLE))
    {
        armv7m_rtos_task_destroy(task);
    }

    armv7m_rtos_task_timeout_schedule();
    
    armv7m_rtos_task_schedule();
    
    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_detach(k_task_t *task)
{
    // armv7m_rtt_printf("k_task_detach(task=%08x)\n", task);

    if (!task || !task->link)
    {
        return K_ERR_INVALID_OBJECT;
    }

    if (task == armv7m_rtos_control.task_default)
    {
        return K_ERR_ILLEGAL_USE;
    }

    if (!(task->state & K_TASK_STATE_JOINABLE))
    {
        return K_ERR_TASK_ALREADY_DETACHED;
    }

    if (task->join)
    {
        return K_ERR_TASK_ALREADY_JOINED;
    }

