GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/rtos_task.c
    task->state &= ~K_TASK_STATE_JOINABLE;

    if (task->state & K_TASK_STATE_TERMINATED)
    {
        armv7m_rtos_task_destroy(task);
    }
    
    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_join(k_task_t *task)
{
    k_task_t *self;

    // armv7m_rtt_printf("k_task_join(task=%08x)\n", task);

    if (armv7m_rtos_control.work_self)
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }
    
    if (armv7m_rtos_control.system_state != K_STATE_RUNNING)
    {
        return K_ERR_ILLEGAL_USE;
    }

    if (task == armv7m_rtos_control.task_default)
    {
        return K_ERR_ILLEGAL_USE;
    }
    
    if (!task || !task->link)
    {
        return K_ERR_INVALID_OBJECT;
    }
    
    if (!(task->state & K_TASK_STATE_JOINABLE))
    {
        return K_ERR_TASK_NOT_JOINABLE;
    }
    
    if (task->join)
    {
        return K_ERR_TASK_ALREADY_JOINED;
    }

    if (task->state & K_TASK_STATE_TERMINATED)
    {
        armv7m_rtos_task_destroy(task);
    }
    else
    {
        self = armv7m_rtos_control.task_self;

        task->join = self;
        
        armv7m_rtos_task_ready_remove(self);
        
        self->wait.join.task = task;
        
        self->state |= K_TASK_STATE_WAIT_JOIN;
        
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
        (*armv7m_rtos_control.hook_table->task_block)(self, (self->state & K_TASK_STATE_CAUSE_MASK));
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
        
        armv7m_rtos_task_schedule();
    }
    
    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_enumerate(uint32_t *p_count_return, k_task_t **p_task_return, uint32_t count)
{
    k_task_t *task;
    uint32_t index;

    // armv7m_rtt_printf("k_task_enumerate(p_count_return=%08x, p_task_return=%08x, count=%d)\n", p_count_return, p_task_return, count);

    for (task = armv7m_rtos_control.task_link, index = 0; task != K_TASK_SENTINEL; task = task->link, index++)
    {
        if (p_task_return)
        {
            if (index < count)
            {
                p_task_return[index] = task;
            }
        }
    }
    
    if (p_count_return)
    {
        *p_count_return = index;
    }

    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_info(k_task_t *task, k_task_info_t *p_task_info_return)
{
    // armv7m_rtt_printf("k_task_info(task=%08x, p_task_info_return=%08x)\n", task, p_task_info_return);

    if (!task || !task->link)
    {
        return K_ERR_INVALID_OBJECT;
    }

    if (p_task_info_return)
    {
        p_task_info_return->name = task->name;
        p_task_info_return->priority = task->priority;
        p_task_info_return->bpriority = task->bpriority;
        p_task_info_return->state = armv7m_rtos_task_state(task);
        p_task_info_return->wait = (task->state & K_TASK_STATE_WAIT_MASK);
    }
    
    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_stack(k_task_t *task, uint32_t *p_stack_base_return, uint32_t *p_stack_size_return, uint32_t *p_stack_space_return)
{
    uint32_t *stack_end;
    
    // armv7m_rtt_printf("k_task_stack(task=%08x, p_stack_base_return=%08x, p_stack_size_return=%08x, p_stack_space_return=%08x)\n", task, p_stack_base_return, p_stack_size_return, p_stack_space_return);

    if (!task || !task->link || (task->state & K_TASK_STATE_TERMINATED))
    {
        return K_ERR_INVALID_OBJECT;
    }

    if (p_stack_base_return)
    {
        *p_stack_base_return = (uint32_t)task->stack_limit;
    }
    
    if (p_stack_size_return)
    {
        *p_stack_size_return = (uint32_t)task->stack_base - (uint32_t)task->stack_limit;
    }

    if (p_stack_space_return)
    {
        if (task->stack_end > task->stack_top)
        {
            task->stack_end = task->stack_top;
        }
            
        for (stack_end = (uint32_t*)task->stack_limit; stack_end < (uint32_t*)task->stack_end; stack_end += 2)
        {
            if ((stack_end[0] != 0xaaaaaaaa) || (stack_end[1] != 0x77777777))
            {
                break;
            }
        }

        task->stack_end = stack_end;

        *p_stack_space_return = (uint32_t)task->stack_end - (uint32_t)task->stack_limit;
    }
    
    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_unblock(k_task_t *task)
{
    // armv7m_rtt_printf("k_task_unblock(task=%08x)\n", task);

    if (!task || !task->link || (task->state & K_TASK_STATE_TERMINATED))
    {
        return K_ERR_INVALID_OBJECT;
    }

    if (!(task->state & K_TASK_STATE_WAIT_MASK))
    {
        return K_ERR_TASK_NOT_BLOCKED;
    }

    armv7m_rtos_task_unblock(task, K_ERR_UNSATISFIED);

    armv7m_rtos_task_timeout_schedule();
    
    armv7m_rtos_task_schedule();
    
    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_suspend(k_task_t *task)
{
    // armv7m_rtt_printf("k_task_suspend(task=%08x)\n", task);

    if (task == armv7m_rtos_control.task_self)
    {
        if (armv7m_rtos_control.system_state != K_STATE_RUNNING)
        {
            return K_ERR_ILLEGAL_USE;
        }
    }

    if (!task || !task->link || (task->state & K_TASK_STATE_TERMINATED))
    {
        return K_ERR_INVALID_OBJECT;
    }

    if (task->state & K_TASK_STATE_SUSPENDED)
    {
        return K_ERR_TASK_ALREADY_SUSPENDED;
    }

    if (task->state & K_TASK_STATE_READY)
    {
        armv7m_rtos_task_ready_remove(task);
    }

    task->state |= K_TASK_STATE_SUSPENDED;

#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
    (*armv7m_rtos_control.hook_table->task_block)(task, (task->state & K_TASK_STATE_CAUSE_MASK));
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */
    
    armv7m_rtos_task_schedule();
    
    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_resume(k_task_t *task)
{
    k_task_t *task_resume;
    
    // armv7m_rtt_printf("k_task_resume(task=%08x)\n", task);

    if (!task || !task->link || (task->state & K_TASK_STATE_TERMINATED))
    {
        return K_ERR_INVALID_OBJECT;
    }

    if (!(task->state & K_TASK_STATE_SUSPENDED))
    {
        return K_ERR_TASK_NOT_SUSPENDED;
    }

    if (__armv7m_atomic_cas((volatile uint32_t*)&task->resume, (uint32_t)NULL, (uint32_t)K_TASK_SENTINEL) != (uint32_t)NULL)
    {
        return K_ERR_TASK_NOT_SUSPENDED;
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        armv7m_rtos_task_resume_process(task);
    }
    else
    {
        task_resume = (k_task_t*)__armv7m_atomic_swap((volatile uint32_t*)&armv7m_rtos_control.task_resume, (uint32_t)task);
        
