GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/rtos_task.c
        task->resume = task_resume;

        if (task_resume == K_TASK_SENTINEL)
        {
            armv7m_pendsv_raise(ARMV7M_PENDSV_SWI_RTOS_TASK_RESUME);
        }
    }

    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_set_priority(k_task_t *task, uint32_t priority, uint32_t *p_priority_return)
{
    uint32_t priority_previous;

    // armv7m_rtt_printf("k_task_set_priority(task=%08x, priority=%d, p_priority_return=%08x)\n", task, priority, p_priority_return);

    if (!task || !task->link || (task->state & K_TASK_STATE_TERMINATED))
    {
        return K_ERR_INVALID_OBJECT;
    }

    if (priority > K_PRIORITY_MIN)
    {
        return K_ERR_INVALID_PARAMETER;
    }

    priority_previous = task->bpriority;
    
    if (priority != K_PRIORITY_CURRENT)
    {
        if (task->bpriority != priority)
        {
            task->bpriority = priority;

            armv7m_rtos_task_priority(task);

            armv7m_rtos_task_schedule();
        }
    }
    
    if (p_priority_return)
    {
        *p_priority_return = priority_previous;
    }

    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_get_priority(k_task_t *task, uint32_t *p_priority_return)
{
    // armv7m_rtt_printf("k_task_get_priority(task=%08x, p_priority_return=%08x)\n", task, p_priority_return);

    if (!task || !task->link || (task->state & K_TASK_STATE_TERMINATED))
    {
        return K_ERR_INVALID_OBJECT;
    }

    if (p_priority_return)
    {
      *p_priority_return = task->priority;
    }

    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_delay(uint32_t delay)
{
    k_task_t *self;

    // armv7m_rtt_printf("k_task_delay(delay=%d)\n", delay);

    if (armv7m_rtos_control.work_self)
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }
    
    if (armv7m_rtos_control.system_state != K_STATE_RUNNING)
    {
        return K_ERR_ILLEGAL_USE;
    }

    if (!delay)
    {
        return K_ERR_INVALID_PARAMETER;
    }

    self = armv7m_rtos_control.task_self;
    
    armv7m_rtos_task_ready_remove(self);
        
    self->state |= K_TASK_STATE_WAIT_DELAY;

    armv7m_rtos_task_timeout_relative(self, delay);
    
#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
    (*armv7m_rtos_control.hook_table->task_block)(self, (self->state & K_TASK_STATE_CAUSE_MASK));
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */

    armv7m_rtos_task_schedule();
    
    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_delay_until(uint32_t clock_l, uint32_t clock_h)
{
    k_task_t *self;
    uint64_t clock;

    // armv7m_rtt_printf("k_task_delay_until(clock=%08x%08x)\n", clock_h, clock_l);

    if (armv7m_rtos_control.work_self)
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    if (armv7m_rtos_control.system_state != K_STATE_RUNNING)
    {
        return K_ERR_ILLEGAL_USE;
    }

    if (!clock_l && !clock_h)
    {
        return K_ERR_INVALID_PARAMETER;
    }
    
    clock = (((uint64_t)clock_l << 0) | ((uint64_t)clock_h << 32));

    self = armv7m_rtos_control.task_self;

    armv7m_rtos_task_ready_remove(self);

    self->state |= K_TASK_STATE_WAIT_DELAY;
        
    armv7m_rtos_task_timeout_absolute(self, clock);

#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
    (*armv7m_rtos_control.hook_table->task_block)(self, (self->state & K_TASK_STATE_CAUSE_MASK));
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */

    armv7m_rtos_task_schedule();
    
    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_sleep(uint32_t timeout)
{
    k_task_t *self;

    // armv7m_rtt_printf("k_task_sleep(timeout=%d)\n", timeout);

    if (armv7m_rtos_control.work_self)
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    self = armv7m_rtos_control.task_self;

    if (!self)
    {
        return K_ERR_ILLEGAL_USE;
    }

    if (armv7m_rtos_control.system_state != K_STATE_RUNNING)
    {
        if (timeout != K_TIMEOUT_NONE)
        {
            return K_ERR_INVALID_PARAMETER;
        }
    }

    if (self->state & K_TASK_STATE_WAKEUP)
    {
        self->state &= ~K_TASK_STATE_WAKEUP;

        return K_NO_ERROR;
    }

    if (timeout == K_TIMEOUT_NONE)
    {
        return K_ERR_UNSATISFIED;
    }

    armv7m_rtos_task_ready_remove(self);

    self->state |= K_TASK_STATE_WAIT_SLEEP;
    
    if (timeout != K_TIMEOUT_FOREVER)
    {
        armv7m_rtos_task_timeout_relative(self, timeout);
    }

#if (ARMV7M_RTOS_HOOK_SUPPORTED == 1)
    (*armv7m_rtos_control.hook_table->task_block)(self, (self->state & K_TASK_STATE_CAUSE_MASK));
#endif /* ARMV7M_RTOS_HOOK_SUPPORTED == 1 */

    armv7m_rtos_task_schedule();

    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_wakeup(k_task_t *task)
{
    k_task_t *task_wakeup;

    // armv7m_rtt_printf("k_task_wakeup(task=%08x)\n", task);

    if (!task || !task->link || (task->state & K_TASK_STATE_TERMINATED))
    {
        return K_ERR_INVALID_OBJECT;
    }

    if (__armv7m_atomic_cas((volatile uint32_t*)&task->wakeup, (uint32_t)NULL, (uint32_t)K_TASK_SENTINEL) != (uint32_t)NULL)
    {
        return K_NO_ERROR;
    }

    if (armv7m_core_is_in_svcall_or_pendsv())
    {
        armv7m_rtos_task_wakeup_process(task);
    }
    else
    {
        task_wakeup = (k_task_t*)__armv7m_atomic_swap((volatile uint32_t*)&armv7m_rtos_control.task_wakeup, (uint32_t)task);
        
        task->wakeup = task_wakeup;

        if (task_wakeup == K_TASK_SENTINEL)
        {
            armv7m_pendsv_raise(ARMV7M_PENDSV_SWI_RTOS_TASK_WAKEUP);
        }
    }

    return K_NO_ERROR;
}

static int __svc_armv7m_rtos_task_yield(void)
{
    k_task_t *self;

    // armv7m_rtt_printf("k_task_yield()\n");
    
    if (armv7m_rtos_control.work_self)
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    if (armv7m_rtos_control.system_state != K_STATE_RUNNING)
    {
        return K_ERR_ILLEGAL_USE;
    }

    self = armv7m_rtos_control.task_self;

    armv7m_rtos_task_ready_remove(self);
    armv7m_rtos_task_ready_insert(self);

    armv7m_rtos_task_schedule();
    
    return K_NO_ERROR;
}

/******************************************************************************************************************************/

int k_task_create(k_task_t *task, const char *name, k_task_routine_t routine, void *context, uint32_t priority, void *stack_base, uint32_t stack_size, uint32_t options)
{
    k_task_params_t params;

    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    params.name = name;
    params.routine = routine;
    params.context = context;
    params.priority = priority;
    params.stack_base = stack_base;
    params.stack_size = stack_size;
    params.options = options;

    return armv7m_svcall_2((uint32_t)&__svc_armv7m_rtos_task_create, (uint32_t)task, (uint32_t)&params);
}

void k_task_exit(void)
{
    if (!armv7m_core_is_in_thread())
    {
        return;
    }
    
    if (armv7m_rtos_control.work_self)
    {
        return;
    }
    
    armv7m_rtos_task_exit();
}

int k_task_terminate(k_task_t *task)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    if ((task == armv7m_rtos_control.task_self) && !armv7m_rtos_control.work_self)
    {
        armv7m_rtos_task_exit();
    }

