GrumpyOldPizza/ArduinoCore-stm32wb/system/STM32WBxx/Source/rtos_task.c
    return armv7m_svcall_1((uint32_t)&__svc_armv7m_rtos_task_terminate, (uint32_t)task);
}

int k_task_detach(k_task_t *task)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    return armv7m_svcall_1((uint32_t)&__svc_armv7m_rtos_task_detach, (uint32_t)task);
}

int k_task_join(k_task_t *task)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    return armv7m_svcall_1((uint32_t)&__svc_armv7m_rtos_task_join, (uint32_t)task);
}

bool k_task_is_joinable(k_task_t *task)
{
    return (task && task->link && (task->state & K_TASK_STATE_JOINABLE));
}

k_task_t * __attribute__((optimize("O3"))) k_task_self(void)
{
    return armv7m_rtos_control.task_self;
}

k_task_t * __attribute__((optimize("O3"))) k_task_default(void)
{
    return armv7m_rtos_control.task_default;
}

bool __attribute__((optimize("O3"))) k_task_is_in_progress(void)
{
    return (armv7m_core_is_in_thread() && !armv7m_rtos_control.work_self);
}

int k_task_enumerate(uint32_t *p_count_return, k_task_t **p_task_return, uint32_t count)
{
    if (armv7m_core_is_in_interrupt())
    {
        if (!armv7m_core_is_in_pendsv())
        {
            return K_ERR_ILLEGAL_CONTEXT;
        }

        return __svc_armv7m_rtos_task_enumerate(p_count_return, p_task_return, count);
    }

    return armv7m_svcall_3((uint32_t)&__svc_armv7m_rtos_task_enumerate, (uint32_t)p_count_return, (uint32_t)p_task_return, (uint32_t)count);
}

int k_task_info(k_task_t *task, k_task_info_t *p_task_info_return)
{
    if (armv7m_core_is_in_interrupt())
    {
        if (!armv7m_core_is_in_pendsv())
        {
            return K_ERR_ILLEGAL_CONTEXT;
        }

        return __svc_armv7m_rtos_task_info(task, p_task_info_return);
    }

    return armv7m_svcall_2((uint32_t)&__svc_armv7m_rtos_task_info, (uint32_t)task, (uint32_t)p_task_info_return);
}

int k_task_stack(k_task_t *task, uint32_t *p_stack_base_return, uint32_t *p_stack_size_return, uint32_t *p_stack_space_return)
{
    if (armv7m_core_is_in_interrupt())
    {
        if (!armv7m_core_is_in_pendsv())
        {
            return K_ERR_ILLEGAL_CONTEXT;
        }

        return __svc_armv7m_rtos_task_stack(task, p_stack_base_return, p_stack_size_return, p_stack_space_return);
     }

    return armv7m_svcall_4((uint32_t)&__svc_armv7m_rtos_task_stack, (uint32_t)task, (uint32_t)p_stack_base_return, (uint32_t)p_stack_size_return, (uint32_t)p_stack_space_return);
}

int k_task_unblock(k_task_t *task)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    return armv7m_svcall_1((uint32_t)&__svc_armv7m_rtos_task_unblock, (uint32_t)task);
}

int k_task_suspend(k_task_t *task)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    return armv7m_svcall_1((uint32_t)&__svc_armv7m_rtos_task_suspend, (uint32_t)task);
}

int k_task_resume(k_task_t *task)
{
    if (armv7m_core_is_in_interrupt())
    {
        return __svc_armv7m_rtos_task_resume(task);
    }

    return armv7m_svcall_1((uint32_t)&__svc_armv7m_rtos_task_resume, (uint32_t)task);
}

bool k_task_is_suspended(k_task_t *task)
{
    return (task && task->link && (task->state & K_TASK_STATE_SUSPENDED) && !task->resume);
}

int k_task_set_priority(k_task_t *task, uint32_t priority, uint32_t *p_priority_return)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    return armv7m_svcall_3((uint32_t)&__svc_armv7m_rtos_task_set_priority, (uint32_t)task, (uint32_t)priority, (uint32_t)p_priority_return);
}

int k_task_get_priority(k_task_t *task, uint32_t *p_priority_return)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    return armv7m_svcall_2((uint32_t)&__svc_armv7m_rtos_task_get_priority, (uint32_t)task, (uint32_t)p_priority_return);
}

int k_task_delay(uint32_t delay)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    return armv7m_svcall_1((uint32_t)&__svc_armv7m_rtos_task_delay, (uint32_t)delay);
}

int k_task_delay_until(uint64_t clock)
{
    uint32_t clock_l, clock_h;

    clock_l = (uint32_t)(clock >> 0);
    clock_h = (uint32_t)(clock >> 32);
    
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    return armv7m_svcall_2((uint32_t)&__svc_armv7m_rtos_task_delay_until, (uint32_t)clock_l, (uint32_t)clock_h);
}

int k_task_sleep(uint32_t timeout)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    return armv7m_svcall_1((uint32_t)&__svc_armv7m_rtos_task_sleep, (uint32_t)timeout);
}

int k_task_wakeup(k_task_t *task)
{
    if (armv7m_core_is_in_interrupt())
    {
        return __svc_armv7m_rtos_task_wakeup(task);
    }

    return armv7m_svcall_1((uint32_t)&__svc_armv7m_rtos_task_wakeup, (uint32_t)task);
}

int k_task_yield(void)
{
    if (armv7m_core_is_in_interrupt())
    {
        return K_ERR_ILLEGAL_CONTEXT;
    }

    return armv7m_svcall_0((uint32_t)&__svc_armv7m_rtos_task_yield);
}

/******************************************************************************************************************************/

void RTOS_TASK_RESUME_SWIHandler(void)
{
    armv7m_rtos_task_resume_routine();
}

void RTOS_TASK_WAKEUP_SWIHandler(void)
{
    armv7m_rtos_task_wakeup_routine();
}
